; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=350, out_folder=./training, instance_id=23, seed=2047, goal_proportion=0.03

(define (problem blocksworld-23)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 - object)
 (:init 
    (arm-empty)
    (clear b63)
    (on b63 b6)
    (on b6 b77)
    (on b77 b116)
    (on b116 b241)
    (on-table b241)
    (clear b341)
    (on b341 b300)
    (on b300 b191)
    (on b191 b110)
    (on b110 b207)
    (on-table b207)
    (clear b292)
    (on b292 b41)
    (on-table b41)
    (clear b202)
    (on-table b202)
    (clear b179)
    (on b179 b137)
    (on b137 b153)
    (on b153 b282)
    (on-table b282)
    (clear b101)
    (on b101 b175)
    (on b175 b50)
    (on b50 b34)
    (on b34 b285)
    (on b285 b321)
    (on b321 b252)
    (on-table b252)
    (clear b88)
    (on-table b88)
    (clear b343)
    (on b343 b123)
    (on b123 b223)
    (on-table b223)
    (clear b210)
    (on b210 b294)
    (on b294 b62)
    (on b62 b320)
    (on b320 b99)
    (on-table b99)
    (clear b152)
    (on-table b152)
    (clear b295)
    (on-table b295)
    (clear b129)
    (on b129 b70)
    (on b70 b120)
    (on b120 b291)
    (on b291 b279)
    (on b279 b299)
    (on b299 b347)
    (on b347 b268)
    (on b268 b118)
    (on b118 b145)
    (on-table b145)
    (clear b112)
    (on b112 b45)
    (on b45 b146)
    (on b146 b310)
    (on b310 b262)
    (on b262 b66)
    (on b66 b256)
    (on-table b256)
    (clear b235)
    (on b235 b159)
    (on b159 b232)
    (on b232 b39)
    (on-table b39)
    (clear b108)
    (on b108 b177)
    (on b177 b58)
    (on-table b58)
    (clear b318)
    (on-table b318)
    (clear b217)
    (on b217 b209)
    (on b209 b278)
    (on b278 b332)
    (on-table b332)
    (clear b48)
    (on b48 b130)
    (on b130 b75)
    (on b75 b302)
    (on b302 b4)
    (on-table b4)
    (clear b330)
    (on b330 b306)
    (on b306 b125)
    (on-table b125)
    (clear b32)
    (on b32 b346)
    (on-table b346)
    (clear b276)
    (on b276 b79)
    (on-table b79)
    (clear b138)
    (on-table b138)
    (clear b165)
    (on b165 b233)
    (on b233 b122)
    (on-table b122)
    (clear b339)
    (on b339 b335)
    (on-table b335)
    (clear b305)
    (on b305 b106)
    (on b106 b154)
    (on b154 b132)
    (on b132 b161)
    (on b161 b114)
    (on b114 b85)
    (on-table b85)
    (clear b160)
    (on-table b160)
    (clear b304)
    (on b304 b220)
    (on b220 b36)
    (on b36 b164)
    (on b164 b265)
    (on-table b265)
    (clear b91)
    (on b91 b43)
    (on b43 b42)
    (on b42 b170)
    (on b170 b205)
    (on b205 b212)
    (on b212 b182)
    (on b182 b312)
    (on b312 b311)
    (on b311 b171)
    (on b171 b2)
    (on b2 b96)
    (on b96 b303)
    (on b303 b231)
    (on b231 b319)
    (on b319 b16)
    (on b16 b334)
    (on b334 b59)
    (on b59 b90)
    (on-table b90)
    (clear b333)
    (on b333 b84)
    (on-table b84)
    (clear b213)
    (on-table b213)
    (clear b64)
    (on b64 b328)
    (on b328 b21)
    (on b21 b20)
    (on b20 b322)
    (on b322 b345)
    (on b345 b280)
    (on-table b280)
    (clear b230)
    (on b230 b308)
    (on-table b308)
    (clear b72)
    (on b72 b246)
    (on b246 b218)
    (on-table b218)
    (clear b168)
    (on b168 b251)
    (on b251 b3)
    (on b3 b80)
    (on-table b80)
    (clear b269)
    (on b269 b109)
    (on b109 b181)
    (on-table b181)
    (clear b8)
    (on-table b8)
    (clear b1)
    (on b1 b127)
    (on b127 b167)
    (on b167 b187)
    (on b187 b219)
    (on-table b219)
    (clear b100)
    (on b100 b281)
    (on b281 b142)
    (on b142 b324)
    (on b324 b236)
    (on b236 b71)
    (on b71 b93)
    (on b93 b95)
    (on b95 b155)
    (on b155 b211)
    (on-table b211)
    (clear b329)
    (on-table b329)
    (clear b237)
    (on-table b237)
    (clear b10)
    (on-table b10)
    (clear b61)
    (on b61 b180)
    (on b180 b141)
    (on b141 b172)
    (on b172 b134)
    (on b134 b29)
    (on b29 b277)
    (on b277 b53)
    (on b53 b189)
    (on b189 b327)
    (on b327 b163)
    (on-table b163)
    (clear b204)
    (on b204 b44)
    (on-table b44)
    (clear b31)
    (on-table b31)
    (clear b260)
    (on b260 b51)
    (on b51 b297)
    (on b297 b102)
    (on b102 b87)
    (on b87 b342)
    (on-table b342)
    (clear b28)
    (on b28 b296)
    (on b296 b115)
    (on b115 b117)
    (on b117 b149)
    (on-table b149)
    (clear b68)
    (on b68 b40)
    (on b40 b26)
    (on b26 b56)
    (on-table b56)
    (clear b104)
    (on-table b104)
    (clear b201)
    (on b201 b139)
    (on b139 b94)
    (on b94 b156)
    (on b156 b103)
    (on-table b103)
    (clear b307)
    (on b307 b147)
    (on b147 b78)
    (on-table b78)
    (clear b348)
    (on b348 b188)
    (on-table b188)
    (clear b274)
    (on-table b274)
    (clear b83)
    (on b83 b248)
    (on b248 b197)
    (on b197 b128)
    (on b128 b259)
    (on-table b259)
    (clear b18)
    (on-table b18)
    (clear b25)
    (on b25 b162)
    (on b162 b336)
    (on b336 b271)
    (on-table b271)
    (clear b284)
    (on b284 b338)
    (on b338 b221)
    (on b221 b136)
    (on b136 b301)
    (on b301 b192)
    (on b192 b255)
    (on b255 b331)
    (on b331 b81)
    (on b81 b178)
    (on-table b178)
    (clear b111)
    (on-table b111)
    (clear b151)
    (on b151 b186)
    (on-table b186)
    (clear b257)
    (on b257 b121)
    (on b121 b337)
    (on b337 b309)
    (on b309 b23)
    (on b23 b316)
    (on b316 b47)
    (on b47 b86)
    (on b86 b244)
    (on-table b244)
    (clear b74)
    (on b74 b54)
    (on b54 b350)
    (on b350 b176)
    (on b176 b267)
    (on b267 b97)
    (on b97 b193)
    (on-table b193)
    (clear b290)
    (on b290 b224)
    (on b224 b140)
    (on b140 b250)
    (on b250 b203)
    (on-table b203)
    (clear b225)
    (on b225 b135)
    (on b135 b119)
    (on b119 b158)
    (on-table b158)
    (clear b105)
    (on-table b105)
    (clear b11)
    (on b11 b60)
    (on b60 b215)
    (on b215 b73)
    (on b73 b24)
    (on b24 b22)
    (on-table b22)
    (clear b289)
    (on b289 b245)
    (on b245 b317)
    (on b317 b258)
    (on b258 b133)
    (on-table b133)
    (clear b17)
    (on b17 b5)
    (on-table b5)
    (clear b12)
    (on b12 b185)
    (on-table b185)
    (clear b228)
    (on b228 b184)
    (on b184 b7)
    (on-table b7)
    (clear b249)
    (on b249 b14)
    (on b14 b247)
    (on b247 b183)
    (on b183 b195)
    (on-table b195)
    (clear b264)
    (on-table b264)
    (clear b13)
    (on b13 b157)
    (on b157 b107)
    (on b107 b126)
    (on b126 b254)
    (on b254 b65)
    (on b65 b166)
    (on b166 b196)
    (on b196 b283)
    (on b283 b227)
    (on b227 b323)
    (on b323 b293)
    (on-table b293)
    (clear b49)
    (on-table b49)
    (clear b33)
    (on b33 b253)
    (on b253 b194)
    (on b194 b38)
    (on b38 b226)
    (on-table b226)
    (clear b131)
    (on b131 b273)
    (on-table b273)
    (clear b143)
    (on b143 b37)
    (on b37 b98)
    (on b98 b174)
    (on b174 b144)
    (on-table b144)
    (clear b261)
    (on b261 b298)
    (on b298 b89)
    (on b89 b148)
    (on b148 b286)
    (on b286 b169)
    (on b169 b9)
    (on b9 b315)
    (on-table b315)
    (clear b222)
    (on b222 b198)
    (on b198 b288)
    (on b288 b52)
    (on b52 b76)
    (on b76 b314)
    (on b314 b15)
    (on b15 b173)
    (on b173 b263)
    (on b263 b243)
    (on b243 b270)
    (on b270 b199)
    (on-table b199)
    (clear b326)
    (on b326 b266)
    (on-table b266)
    (clear b124)
    (on b124 b340)
    (on-table b340)
    (clear b200)
    (on b200 b55)
    (on b55 b92)
    (on b92 b240)
    (on b240 b206)
    (on b206 b272)
    (on b272 b234)
    (on b234 b67)
    (on b67 b344)
    (on b344 b313)
    (on b313 b238)
    (on b238 b190)
    (on b190 b35)
    (on b35 b239)
    (on-table b239)
    (clear b30)
    (on-table b30)
    (clear b275)
    (on-table b275)
    (clear b287)
    (on b287 b46)
    (on b46 b216)
    (on b216 b349)
    (on b349 b82)
    (on b82 b150)
    (on-table b150)
    (clear b57)
    (on b57 b19)
    (on b19 b229)
    (on b229 b208)
    (on b208 b27)
    (on-table b27)
    (clear b214)
    (on-table b214)
    (clear b69)
    (on b69 b242)
    (on b242 b113)
    (on b113 b325)
    (on-table b325))
 (:goal  (and 
    (clear b7)
    (on b7 b9)
    (on b9 b6)
    (on b6 b8)
    (on b8 b1)
    (on-table b1)
    (clear b3)
    (on b3 b10)
    (on b10 b4)
    (on b4 b2)
    (on b2 b5)
    (on-table b5))))

; plan
1. (unstack b1 b127)
   deleted: (on b1 b127) (clear b1) (arm-empty)
   added: (holding b1) (clear b127)
   goals met: 1 of 12
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 12
3. (unstack b168 b251)
   deleted: (on b168 b251) (clear b168) (arm-empty)
   added: (holding b168) (clear b251)
   goals met: 2 of 12
4. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 2 of 12
5. (unstack b17 b5)
   deleted: (on b17 b5) (clear b17) (arm-empty)
   added: (holding b17) (clear b5)
   goals met: 2 of 12
6. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 12
7. (unstack b228 b184)
   deleted: (on b228 b184) (clear b228) (arm-empty)
   added: (holding b228) (clear b184)
   goals met: 2 of 12
8. (putdown b228)
   deleted: (holding b228)
   added: (clear b228) (arm-empty) (on-table b228)
   goals met: 2 of 12
9. (unstack b184 b7)
   deleted: (on b184 b7) (clear b184) (arm-empty)
   added: (holding b184) (clear b7)
   goals met: 3 of 12
10. (putdown b184)
   deleted: (holding b184)
   added: (clear b184) (arm-empty) (on-table b184)
   goals met: 3 of 12
11. (unstack b251 b3)
   deleted: (on b251 b3) (clear b251) (arm-empty)
   added: (holding b251) (clear b3)
   goals met: 4 of 12
12. (putdown b251)
   deleted: (holding b251)
   added: (clear b251) (arm-empty) (on-table b251)
   goals met: 4 of 12
13. (unstack b261 b298)
   deleted: (on b261 b298) (clear b261) (arm-empty)
   added: (holding b261) (clear b298)
   goals met: 4 of 12
14. (putdown b261)
   deleted: (holding b261)
   added: (clear b261) (arm-empty) (on-table b261)
   goals met: 4 of 12
15. (unstack b298 b89)
   deleted: (on b298 b89) (clear b298) (arm-empty)
   added: (holding b298) (clear b89)
   goals met: 4 of 12
16. (putdown b298)
   deleted: (holding b298)
   added: (clear b298) (arm-empty) (on-table b298)
   goals met: 4 of 12
17. (unstack b48 b130)
   deleted: (on b48 b130) (clear b48) (arm-empty)
   added: (holding b48) (clear b130)
   goals met: 4 of 12
18. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 4 of 12
19. (unstack b130 b75)
   deleted: (on b130 b75) (clear b130) (arm-empty)
   added: (holding b130) (clear b75)
   goals met: 4 of 12
20. (putdown b130)
   deleted: (holding b130)
   added: (clear b130) (arm-empty) (on-table b130)
   goals met: 4 of 12
21. (unstack b63 b6)
   deleted: (on b63 b6) (clear b63) (arm-empty)
   added: (holding b63) (clear b6)
   goals met: 4 of 12
22. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 4 of 12
23. (unstack b75 b302)
   deleted: (on b75 b302) (clear b75) (arm-empty)
   added: (holding b75) (clear b302)
   goals met: 4 of 12
24. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 4 of 12
25. (unstack b302 b4)
   deleted: (on b302 b4) (clear b302) (arm-empty)
   added: (holding b302) (clear b4)
   goals met: 4 of 12
26. (putdown b302)
   deleted: (holding b302)
   added: (clear b302) (arm-empty) (on-table b302)
   goals met: 4 of 12
27. (unstack b89 b148)
   deleted: (on b89 b148) (clear b89) (arm-empty)
   added: (holding b89) (clear b148)
   goals met: 4 of 12
28. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 4 of 12
29. (unstack b148 b286)
   deleted: (on b148 b286) (clear b148) (arm-empty)
   added: (holding b148) (clear b286)
   goals met: 4 of 12
30. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 4 of 12
31. (unstack b286 b169)
   deleted: (on b286 b169) (clear b286) (arm-empty)
   added: (holding b286) (clear b169)
   goals met: 4 of 12
32. (putdown b286)
   deleted: (holding b286)
   added: (clear b286) (arm-empty) (on-table b286)
   goals met: 4 of 12
33. (unstack b169 b9)
   deleted: (on b169 b9) (clear b169) (arm-empty)
   added: (holding b169) (clear b9)
   goals met: 4 of 12
34. (putdown b169)
   deleted: (holding b169)
   added: (clear b169) (arm-empty) (on-table b169)
   goals met: 4 of 12
35. (unstack b91 b43)
   deleted: (on b91 b43) (clear b91) (arm-empty)
   added: (holding b91) (clear b43)
   goals met: 4 of 12
36. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 4 of 12
37. (unstack b43 b42)
   deleted: (on b43 b42) (clear b43) (arm-empty)
   added: (holding b43) (clear b42)
   goals met: 4 of 12
38. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 4 of 12
39. (unstack b42 b170)
   deleted: (on b42 b170) (clear b42) (arm-empty)
   added: (holding b42) (clear b170)
   goals met: 4 of 12
40. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 4 of 12
41. (unstack b170 b205)
   deleted: (on b170 b205) (clear b170) (arm-empty)
   added: (holding b170) (clear b205)
   goals met: 4 of 12
42. (putdown b170)
   deleted: (holding b170)
   added: (clear b170) (arm-empty) (on-table b170)
   goals met: 4 of 12
43. (unstack b205 b212)
   deleted: (on b205 b212) (clear b205) (arm-empty)
   added: (holding b205) (clear b212)
   goals met: 4 of 12
44. (putdown b205)
   deleted: (holding b205)
   added: (clear b205) (arm-empty) (on-table b205)
   goals met: 4 of 12
45. (unstack b212 b182)
   deleted: (on b212 b182) (clear b212) (arm-empty)
   added: (holding b212) (clear b182)
   goals met: 4 of 12
46. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 4 of 12
47. (unstack b182 b312)
   deleted: (on b182 b312) (clear b182) (arm-empty)
   added: (holding b182) (clear b312)
   goals met: 4 of 12
48. (putdown b182)
   deleted: (holding b182)
   added: (clear b182) (arm-empty) (on-table b182)
   goals met: 4 of 12
49. (unstack b312 b311)
   deleted: (on b312 b311) (clear b312) (arm-empty)
   added: (holding b312) (clear b311)
   goals met: 4 of 12
50. (putdown b312)
   deleted: (holding b312)
   added: (clear b312) (arm-empty) (on-table b312)
   goals met: 4 of 12
51. (unstack b311 b171)
   deleted: (on b311 b171) (clear b311) (arm-empty)
   added: (holding b311) (clear b171)
   goals met: 4 of 12
52. (putdown b311)
   deleted: (holding b311)
   added: (clear b311) (arm-empty) (on-table b311)
   goals met: 4 of 12
53. (unstack b171 b2)
   deleted: (on b171 b2) (clear b171) (arm-empty)
   added: (holding b171) (clear b2)
   goals met: 4 of 12
54. (putdown b171)
   deleted: (holding b171)
   added: (clear b171) (arm-empty) (on-table b171)
   goals met: 4 of 12
55. (unstack b2 b96)
   deleted: (on b2 b96) (clear b2) (arm-empty)
   added: (holding b2) (clear b96)
   goals met: 4 of 12
56. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 5 of 12
57. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 12
58. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 6 of 12
59. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 6 of 12
60. (stack b10 b4)
   deleted: (clear b4) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b4)
   goals met: 7 of 12
61. (unstack b6 b77)
   deleted: (on b6 b77) (clear b6) (arm-empty)
   added: (holding b6) (clear b77)
   goals met: 7 of 12
62. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 8 of 12
63. (unstack b9 b315)
   deleted: (on b9 b315) (clear b9) (arm-empty)
   added: (holding b9) (clear b315)
   goals met: 8 of 12
64. (stack b9 b6)
   deleted: (clear b6) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b6)
   goals met: 9 of 12
65. (unstack b3 b80)
   deleted: (on b3 b80) (clear b3) (arm-empty)
   added: (holding b3) (clear b80)
   goals met: 8 of 12
66. (stack b3 b10)
   deleted: (clear b10) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b10)
   goals met: 10 of 12
67. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 9 of 12
68. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 9 of 12
69. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 8 of 12
70. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 10 of 12
71. (unstack b6 b8)
   deleted: (on b6 b8) (clear b6) (arm-empty)
   added: (holding b6) (clear b8)
   goals met: 9 of 12
72. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 9 of 12
73. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 9 of 12
74. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 10 of 12
75. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 10 of 12
76. (stack b6 b8)
   deleted: (clear b8) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b8)
   goals met: 11 of 12
77. (unstack b7 b9)
   deleted: (on b7 b9) (clear b7) (arm-empty)
   added: (holding b7) (clear b9)
   goals met: 9 of 12
78. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 10 of 12
79. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 10 of 12
80. (stack b9 b6)
   deleted: (clear b6) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b6)
   goals met: 11 of 12
81. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 10 of 12
82. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 12 of 12
